import requests
import json
import os
from bs4 import BeautifulSoup
from tqdm import tqdm


def get_dataset(links: list) -> list:
    dataset = []
    for link in tqdm(links):
        response = requests.get(link)
        soup = BeautifulSoup(response.text, 'html.parser')
        news_list = soup.find_all('div', class_='one')

        titles = []
        for i in range(len(news_list)):
            titles.append(news_list[i].text.strip())

        def clean(row: str) -> list:
            cleaned_row = row.strip().lower()
            for symbol in cleaned_row:
                if symbol in ['—', '~', '!', '@', '%', '^', '&', '*', '(', ')', '_', '=', '+', '[', ']', ';', ':', ',', '.', '/', '"', "'", '»', '«']:
                    cleaned_row = cleaned_row.replace(symbol, '')
            cleaned_row = cleaned_row.replace('  ', ' ').replace('   ', ' ').replace('    ', ' ').replace('     ', ' ')
            cleaned_row = cleaned_row.split()
            if cleaned_row[0][0] in ['0', '1', '2']:
                cleaned_row = cleaned_row[1:]
                return cleaned_row
            else:
                return cleaned_row

        cleaned_titles = [clean(title) for title in titles]

        noise = [
            # Союзы
            "и", "да", "ни", "ни", "тоже", "также", "а", "но", "зато", "однако",
            "или", "либо", "то", "то", "не то", "не то", "то ли", "то ли", "то есть",
            "а именно", "потому что", "так как", "оттого что", "благодаря тому что",
            "чтобы", "дабы", "если", "раз", "коли", "когда", "пока", "лишь", "едва",
            "прежде чем", "как", "будто", "словно", "точно", "как будто", "хотя",
            "несмотря на то что", "так что", "вновь",

            # Частицы
            "пусть", "пускай", "давай", "давайте", "бы", "б", "да", "не", "ни", "ли",
            "разве", "неужели", "именно", "как раз", "только", "лишь", "исключительно",
            "почти", "даже", "же", "ведь", "что за", "как", "ну и", "все-таки",

            # Предлоги
            "в", "на", "за", "под", "перед", "о", "у", "по", "для", "без", "от", "до",
            "к", "с", "из", "про", "об", "из-за", "из-под", "по-за", "по-над",
            "в течение", "в продолжение", "в заключение", "несмотря на", "ввиду",
            "в отличие от", "при", "еще", "во", "все",

            # Местоимения
            "я", "ты", "он", "она", "оно", "мы", "вы", "они", "мой", "твой", "свой",
            "наш", "ваш", "их", "его", "ее", "ихний", "этот", "тот", "такой", "весь",
            "всякий", "любой", "некоторый", "сам", "каждый", "никакой", "кто", "что",
            "какой", "чей", "сколько", "где", "когда", "куда", "откуда", "почему",
            "зачем", "как", "каков", "какие", "другие", "какое",

            # Наречия и вводные слова
            "там", "тут", "здесь", "сюда", "туда", "оттуда", "везде", "всюду", "где-то",
            "как-то", "почему-то", "зачем-то", "поэтому", "вообще", "наверное",
            "действительно", "конечно", "может", "кажется", "вероятно", "очевидно",
            "несомненно", "безусловно", "точно", "примерно", "почти", "особенно",
            "естественно", "кстати", "например", "через", "более", "чем", "после",

            # Глаголы-связки
            "есть", "был", "была", "было", "были", "станет", "становится", "является", "начнется", 
            "хотят", "просит", "проведена", "стал", "оказывается", "казался", "казалось", "остается", 
            "остался", "быть", "будут", "будет", "рассказали", "появилось", "предлагает",

            # Числительные
            "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять",
            "десять", "первый", "второй", "третий", "четвертый", "пятый", "шестой",
            "седьмой", "восьмой", "девятый", "десятый", "сто", "тысяча", "миллион", "тысяч", 
            "миллионов", "миллиона", "миллиарда", "тысячи",

            # Дополнительно
            "кыргызстан", "кыргызстана", "кыргызстане", "кр", "кыргызстанцев", "кыргызстанец", "кыргызстанцы", "бишкек", "бишкека", "бишкеке", "сом", "сома", "сомов", "сому",
            "январь", "февраль", "март", "апрель", "май", "июнь", "июль", "август", "сентябрь", "октябрь", "ноябрь", "декабрь",
            "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря",
            "время", "сегодня", "части", "год", "году", "года", "дня", "даты",
            "мероприятия", "южной", "глава", "международный", "области", "названиями", "одинаковыми", "против", "процентов", "районе",
            "государству", "человек", "мира", "просят", "предлагают", "нашли", "лет", "со", "улиц", "поздравляет", "присоединения",
            "чуйской", "могут", "самым", "обсудили", "стран", "температурные", "рассказал", "больше", "развития", "центральной", "день",
            "3", "31", "тепло", "23-28", "526", "2024", "1", "регионах", "мужчина", "10", "15", "происходит", "20", "2023", "начала",
            "11", "№", "24kg", "2025", "улице", "нет", "цифра", "пройдет", "неделю", "хочет", "12", "2", "теперь", "днем", "это", "25", "14", "можно",
            "ситуация", "человека", "всего", "двух", "открыли", "работу", "чудаки", "состоянии", "30", "граждан", "13", "5", "возле",
            "жизни", "дом", "подробности", "4", "центр", "повторные", "7", "17", "участием", "компания", "начали", "участие", "две", "центре",
            "помощи", "новых", "случаев", "вторжение", "рубрике", "число", "получили", "16", "8", "среди", "18", "процента", "получил",
            "тяжелом", "кыргызстану", "работы", "встретился", "решение", "100", "внебольничной", "6", "прокомментировал", "внимание",
            "миллиардов", "службы", "считает", "выставки", "компании", "место", "стали", "имени", "жарким", "работать", "улицы", "впервые",
            "кыргызстанца", "микрорайоне", "нового", "требуют", "уже", "вопрос", "проходит", "проезд", "23", "всех", "призвал", "здание",
            "снова", "9", "требует", "комментарий", "28", "пытались", "21", "22", "26", "получить", "27", "создать", "призывает", "24", "тонн",
            "200", "трех", "19", "бишкекчанин", "предложил", "список", "вышли", "обещают", "некоторые", "раза", "обещает", "стало", "над", "свою",
            "нужно", "стала", "новую", "передали", "опять", "поступило", "месте", "этому", "двое", "некоторых", "29", "около", "прошел", "правила",
            "себя", "оставили", "появится", "систему", "игры", "смогут", "бывший", "кыргызстанка", "центра", "кыргызстанцам", "назвал", "планирует",
            "провел", "должны", "между", "ситуации", "одного", "ответ", "пытался", "40", "города", "новый", "новые", "новая", "новое", "данных", "жители",
            "основных", "относительно"
        ]
        
        all_words = [word for title in cleaned_titles for word in title if word not in noise]

        dataset.extend(all_words)
    
    if not os.path.exists('outputs'):
        os.mkdir('outputs')
    
    with open('outputs/dataset.jsonl', 'a', encoding='utf-8') as f:
        for word in dataset:
            row = word
            f.write(json.dumps(row, ensure_ascii=False) + '\n')
    
    print()
    print('=' * 50)
    print(f'{len(dataset)} values have been retrieved')
    print(f'The list of values has been saved in outputs/dataset.jsonl')
    print('=' * 50)
    print()
    
    return dataset